---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PropertyLine
source: html/c13561ff-345b-78b4-ca2f-fc81511cc626.htm
---
# PropertyLine Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.